app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Heather's"], ["address", "455 Tamarack Lane"], ["created_at", "2021-09-20 02:31:36.882279"], ["updated_at", "2021-09-20 02:31:36.882279"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 1]]
---
  def destroy
    @location.destroy

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_location
      @location = Location.find(params[:id])